ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/sysctl.xml
<module id="SYSCTL" HW_revision=""><register id="REBOOT_CTL" width="32" offset="0x0" internal="0" description="Reboot Control Register"><bitfield id="REBOOT" description="Write 1 initiates a Reboot of the device" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="WKEY" description="Key to enable writes to bit 0" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="NMI_CTLSTAT" width="32" offset="0x4" internal="0" description="NMI Control and Status Register"><bitfield id="CS_SRC" description="CS interrupt as a source of NMI" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="CS_SRC__0" value="0" description="Disables CS interrupt as a source of NMI"/><bitenum id="CS_SRC__1" value="1" description="Enables CS interrupt as a source of NMI"/></bitfield><bitfield id="PSS_SRC" description="PSS interrupt as a source of NMI" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="PSS_SRC__0" value="0" description="Disables the PSS interrupt as a source of NMI"/><bitenum id="PSS_SRC__1" value="1" description="Enables the PSS interrupt as a source of NMI"/></bitfield><bitfield id="PCM_SRC" description="PCM interrupt as a source of NMI" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="PCM_SRC__0" value="0" description="Disbles the PCM interrupt as a source of NMI"/><bitenum id="PCM_SRC__1" value="1" description="Enables the PCM interrupt as a source of NMI"/></bitfield><bitfield id="PIN_SRC" description="RSTn/NMI pin configuration&#13;&#10;Note: When the device enters LPM3/L" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="PIN_SRC__0" value="0" description="Configures the RSTn_NMI pin as a source of POR Class Reset"/><bitenum id="PIN_SRC__1" value="1" description="Configures the RSTn_NMI pin as a source of NMI"/></bitfield><bitfield id="CS_FLG" description="This flag gets auto-cleared when the corresponding source flag " begin="16" end="16" width="1" rwaccess="R/W"><bitenum id="CS_FLG__0" value="0" description="indicates CS interrupt was not the source of NMI"/><bitenum id="CS_FLG__1" value="1" description="indicates CS interrupt was the source of NMI"/></bitfield><bitfield id="PSS_FLG" description="This flag gets auto-cleared when the corresponding source flag " begin="17" end="17" width="1" rwaccess="R/W"><bitenum id="PSS_FLG__0" value="0" description="indicates the PSS interrupt was not the source of NMI"/><bitenum id="PSS_FLG__1" value="1" description="indicates the PSS interrupt was the source of NMI"/></bitfield><bitfield id="PCM_FLG" description="This flag gets auto-cleared when the corresponding source flag " begin="18" end="18" width="1" rwaccess="R/W"><bitenum id="PCM_FLG__0" value="0" description="indicates the PCM interrupt was not the source of NMI"/><bitenum id="PCM_FLG__1" value="1" description="indicates the PCM interrupt was the source of NMI"/></bitfield><bitfield id="PIN_FLG" description="Indicates if RSTn/NMI pin was the source of NMI" begin="19" end="19" width="1" rwaccess="R/W"><bitenum id="PIN_FLG__0" value="0" description="Indicates the RSTn_NMI pin was not the source of NMI"/><bitenum id="PIN_FLG__1" value="1" description="Indicates the RSTn_NMI pin was the source of NMI"/></bitfield></register><register id="WDTRESET_CTL" width="32" offset="0x8" internal="0" description="Watchdog Reset Control Register"><bitfield id="TIMEOUT" description="WDT timeout reset type" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="TIMEOUT__0" value="0" description="WDT timeout event generates Soft reset"/><bitenum id="TIMEOUT__1" value="1" description="WDT timeout event generates Hard reset"/></bitfield><bitfield id="VIOLATION" description="WDT password violation reset type" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="VIOLATION__0" value="0" description="WDT password violation event generates Soft reset"/><bitenum id="VIOLATION__1" value="1" description="WDT password violation event generates Hard reset"/></bitfield></register><register id="PERIHALT_CTL" width="32" offset="0xC" internal="0" description="Peripheral Halt Control Register"><bitfield id="T16_0" description="" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="T16_0__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="T16_0__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="T16_1" description="" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="T16_1__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="T16_1__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="T16_2" description="" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="T16_2__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="T16_2__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="T16_3" description="" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="T16_3__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="T16_3__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="T32_0" description="" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="T32_0__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="T32_0__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="eUA0" description="" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="eUA0__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="eUA0__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="eUA1" description="" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="eUA1__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="eUA1__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="eUA2" description="" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="eUA2__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="eUA2__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="eUA3" description="" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="eUA3__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="eUA3__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="eUB0" description="" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="eUB0__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="eUB0__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="eUB1" description="" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="eUB1__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="eUB1__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="eUB2" description="" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="eUB2__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="eUB2__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="eUB3" description="" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="eUB3__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="eUB3__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="ADC" description="" begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="ADC__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="ADC__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="WDT" description="" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="WDT__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="WDT__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield><bitfield id="DMA" description="" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="DMA__0" value="0" description="IP operation unaffected when CPU is halted"/><bitenum id="DMA__1" value="1" description="freezes IP operation when CPU is halted"/></bitfield></register><register id="SRAM_SIZE" width="32" offset="0x10" internal="0" description="SRAM Size Register"><bitfield id="SIZE" description="Indicates the size of SRAM on the device" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="SRAM_BANKEN" width="32" offset="0x14" internal="0" description="SRAM Bank Enable Register"><bitfield id="BNK0_EN" description="When 1, enables Bank0 of the SRAM" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="BNK1_EN" description="When set to 1, bank enable bits for all banks below this bank a" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="BNK1_EN__0" value="0" description="Disables Bank1 of the SRAM"/><bitenum id="BNK1_EN__1" value="1" description="Enables Bank1 of the SRAM"/></bitfield><bitfield id="BNK2_EN" description="When set to 1, bank enable bits for all banks below this bank a" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="BNK2_EN__0" value="0" description="Disables Bank2 of the SRAM"/><bitenum id="BNK2_EN__1" value="1" description="Enables Bank2 of the SRAM"/></bitfield><bitfield id="BNK3_EN" description="When set to 1, bank enable bits for all banks below this bank a" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="BNK3_EN__0" value="0" description="Disables Bank3 of the SRAM"/><bitenum id="BNK3_EN__1" value="1" description="Enables Bank3 of the SRAM"/></bitfield><bitfield id="BNK4_EN" description="When set to 1, bank enable bits for all banks below this bank a" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="BNK4_EN__0" value="0" description="Disables Bank4 of the SRAM"/><bitenum id="BNK4_EN__1" value="1" description="Enables Bank4 of the SRAM"/></bitfield><bitfield id="BNK5_EN" description="When set to 1, bank enable bits for all banks below this bank a" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="BNK5_EN__0" value="0" description="Disables Bank5 of the SRAM"/><bitenum id="BNK5_EN__1" value="1" description="Enables Bank5 of the SRAM"/></bitfield><bitfield id="BNK6_EN" description="When set to 1, bank enable bits for all banks below this bank a" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="BNK6_EN__0" value="0" description="Disables Bank6 of the SRAM"/><bitenum id="BNK6_EN__1" value="1" description="Enables Bank6 of the SRAM"/></bitfield><bitfield id="BNK7_EN" description="When set to 1, bank enable bits for all banks below this bank a" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="BNK7_EN__0" value="0" description="Disables Bank7 of the SRAM"/><bitenum id="BNK7_EN__1" value="1" description="Enables Bank7 of the SRAM"/></bitfield><bitfield id="SRAM_RDY" description="This bit will automatically be set to '0' whenever any of the B" begin="16" end="16" width="1" rwaccess="R/W"><bitenum id="SRAM_RDY__0" value="0" description="SRAM is not ready for accesses"/><bitenum id="SRAM_RDY__1" value="1" description="SRAM is ready for accesses"/></bitfield></register><register id="SRAM_BANKRET" width="32" offset="0x18" internal="0" description="SRAM Bank Retention Control Register"><bitfield id="BNK0_RET" description="Bank0 is always retained in LPM3, LPM4 and LPM3" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="BNK1_RET" description="Value of this bit is a don't care in when the device enters LPM" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="BNK1_RET__0" value="0" description="Bank1 of the SRAM is not retained in LPM3 or LPM4"/><bitenum id="BNK1_RET__1" value="1" description="Bank1 of the SRAM is retained in LPM3 and LPM4"/></bitfield><bitfield id="BNK2_RET" description="Value of this bit is a don't care in when the device enters LPM" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="BNK2_RET__0" value="0" description="Bank2 of the SRAM is not retained in LPM3 or LPM4"/><bitenum id="BNK2_RET__1" value="1" description="Bank2 of the SRAM is retained in LPM3 and LPM4"/></bitfield><bitfield id="BNK3_RET" description="Value of this bit is a don't care in when the device enters LPM" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="BNK3_RET__0" value="0" description="Bank3 of the SRAM is not retained in LPM3 or LPM4"/><bitenum id="BNK3_RET__1" value="1" description="Bank3 of the SRAM is retained in LPM3 and LPM4"/></bitfield><bitfield id="BNK4_RET" description="Value of this bit is a don't care in when the device enters LPM" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="BNK4_RET__0" value="0" description="Bank4 of the SRAM is not retained in LPM3 or LPM4"/><bitenum id="BNK4_RET__1" value="1" description="Bank4 of the SRAM is retained in LPM3 and LPM4"/></bitfield><bitfield id="BNK5_RET" description="Value of this bit is a don't care in when the device enters LPM" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="BNK5_RET__0" value="0" description="Bank5 of the SRAM is not retained in LPM3 or LPM4"/><bitenum id="BNK5_RET__1" value="1" description="Bank5 of the SRAM is retained in LPM3 and LPM4"/></bitfield><bitfield id="BNK6_RET" description="Value of this bit is a don't care in when the device enters LPM" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="BNK6_RET__0" value="0" description="Bank6 of the SRAM is not retained in LPM3 or LPM4"/><bitenum id="BNK6_RET__1" value="1" description="Bank6 of the SRAM is retained in LPM3 and LPM4"/></bitfield><bitfield id="BNK7_RET" description="Value of this bit is a don't care in when the device enters LPM" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="BNK7_RET__0" value="0" description="Bank7 of the SRAM is not retained in LPM3 or LPM4"/><bitenum id="BNK7_RET__1" value="1" description="Bank7 of the SRAM is retained in LPM3 and LPM4"/></bitfield><bitfield id="SRAM_RDY" description="This bit will automatically be set to '0' whenever any of the B" begin="16" end="16" width="1" rwaccess="R/W"><bitenum id="SRAM_RDY__0" value="0" description="SRAM banks are being set up for retention"/><bitenum id="SRAM_RDY__1" value="1" description="SRAM is ready for accesses"/></bitfield></register><register id="FLASH_SIZE" width="32" offset="0x20" internal="0" description="Flash Size Register"><bitfield id="SIZE" description=" Indicates the size of the Flash main memory on the device" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="DIO_GLTFLT_CTL" width="32" offset="0x30" internal="0" description="Digital I/O Glitch Filter Control Register"><bitfield id="GLTCH_EN" description="" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="GLTCH_EN__0" value="0" description="Disables glitch filter on the digital I/Os"/><bitenum id="GLTCH_EN__1" value="1" description="Enables glitch filter on the digital I/Os"/></bitfield></register><register id="SECDATA_UNLOCK" width="32" offset="0x40" internal="0" description="IP Protected Secure Zone Data Access Unlock Register"><bitfield id="UNLKEY" description="Unlock Key, which requests for IP protected secure zone to be u" begin="15" end="0" width="16" rwaccess="R/W"/></register></module>